## Lab3 : 외부 데이터 이용하기

In [3]:
import pandas as pd

In [8]:
# excel 파일 'ecel_exam.xlsx'를 읽어들여 Data Frame df_exam으로 저장
df_exam = pd.read_excel('excel_exam.xlsx')

In [9]:
# Data Frame df_exam의 첫 5개 행을 출력
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [10]:
# excel 파일 'excel_exam.xlsx'를 읽어들여 Data Frame df_exam으로 저장
# 단, Data Frame의 index를 'id' 값으로 지정
df_exam = pd.read_excel('excel_exam.xlsx').set_index('id')

In [11]:
df_exam.head()

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        1    45       86       78
4        1    30       98       58
5        2    25       80       65

> 데이터 분석하기

In [12]:
# 컬럼 math의 함 계산
df_exam['math'].sum()

1149

In [13]:
#df_exam의 행의 개수 확인
len(df_exam)

20

In [14]:
# df_exam의 컬럼별 합 계산
df_exam.sum()

nclass       60
math       1149
english    1698
science    1189
dtype: int64

In [15]:
# df_exam의 컬럼별 평균 계산
df_exam.mean()

nclass      3.00
math       57.45
english    84.90
science    59.45
dtype: float64

## Lab 4 엑셀의 첫번째 행이 변수명(컬럼 이름)이 아닌 경우
- 첫 번째 행의 데이터를 컬럼 이름으로 인식함
- Lab4에서 사용한 엑셀 파일에서 첫 행을 삭제하여 실습에 사용

In [20]:
# 엑셀 파일의 첫 번째 행이 컬럼명이 아님
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx')
pd_excel_exam_novar.head()

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45

In [25]:
# 엑셀 파일의 첫 번째 행이 컬럼명이 아니므로, 컬럼명으로 사용하지 않음
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
pd_excel_exam_novar.head()

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15

In [26]:
# 데이터 프레임 pd_excel_exam_novar의 컬럼명 확인
pd_excel_exam_novar.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [28]:
# 데이타 프레임 pd_excel_exam_novar의 컬럼명을 별도로 지정함
pd_excel_exam_novar.columns = ['id', 'nclass', 'math', 'english', 'science']
pd_excel_exam_novar.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       2    25       80       65
3   4       2    50       89       98
4   5       3    20       98       15

In [30]:
# 데이터 프레임 pd_excel_exam_novar의 indax를 컬럼 id로 지정함
pd_excel_exam_novar.set_index('id')

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        2    25       80       65
4        2    50       89       98
5        3    20       98       15
6        3    50       98       45
7        4    46       98       65
8        4    48       87       12

## Lab5 : CSV파일 불러오기
- Lab4에서 사용한 엑셀 파일을 csv 유형 파일로 저장
- csv파일 : 값이 쉼표(,)로 구분되어 저장된 자료 형태

In [38]:
import pandas as pd
df_exam_csv = pd.read_csv('exam.csv')

In [39]:
df_exam_csv.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

## 실습
- df_exam에서 math, english, science의 성적인 50점 이상인 학생의 수를 구하시고
- df_exam에서 math의 성적 평균을 구하시오

In [43]:
df11 = df_exam[['math', 'english', 'science']] > 50
df11.sum()

math       10
english    20
science    13
dtype: int64

In [45]:
df_exam['math'].mean()

57.45

In [47]:
# 1반의 평균을 구하는 방법
df_exam.query('nclass == 1').mean()

nclass      1.00
math       46.25
english    94.75
science    61.50
dtype: float64